function evList() {
  this._init();
}

evList.prototype = {
  name: 'مناسبت‌های رسمی ایران',
  type: 'persian',
  /* [month][day] = [title, isHoliday] */
  events: [[], [], [], [], [], [], [], [], [], [], [], [], []],

  _init: function () {

    this.events[1][1] = [[
      ['آغاز نوروز', true],
    ], true];

    this.events[1][2] = [[
      ['ایّام نوروز', true],
      ['هجوم مأموران ستم‌شاهی پهلوی به مدرسه‌ی فیضیه‌ی قم (۱۳۴۲ ه‍.ش)'],
      ['آغاز عملیات فتح‌المبین (۱۳۶۱ ه‍.ش)'],
    ], true];

    this.events[1][3] = [[
      ['ایّام نوروز', true],
    ], true];

    this.events[1][4] = [[
      ['ایّام نوروز', true],
    ], true];

    this.events[1][6] = [[
      ['ولادت زرتشت'],
    ]];

    this.events[1][7] = [[
      ['روز هنرهای نمایشی'],
    ]];

    this.events[1][12] = [[
      ['روز جمهوری اسلامی ایران', true],
    ], true];

    this.events[1][13] = [[
      ['روز طبیعت', true],
    ], true];

    this.events[1][15] = [[
      ['روز ذخایر ژنتیکی و زیستی'],
    ]];

    this.events[1][18] = [[
      ['روز سلامتی'],
    ]];

    this.events[1][19] = [[
      ['شهادت آیت‌اللّه سیدمحمدباقر صدر و خواهر ایشان بنت‌الهدی به دست حکومت بعث عراق (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[1][20] = [[
      ['روز ملّی فنّاوری هسته‌ای'],
      ['روز هنر انقلاب اسلامی (سالروز شهادت سیدمرتضی آوینی) (۱۳۷۲ ه‍.ش)'],
    ]];

    this.events[1][21] = [[
      ['شهادت امیر سپهبد علی صیاد شیرازی (۱۳۷۸ ه‍.ش)'],
      ['سالروز افتتاح حساب شماره‌ی ۱۰۰ به فرمان امام خمینی (رحمة‌اللّه علیه) و تأسیس بنیاد مسکن انقلاب اسلامی (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[1][25] = [[
      ['روز بزرگداشت عطّار نیشابوری'],
    ]];

    this.events[1][29] = [[
      ['روز ارتش جمهوری اسلامی و نیروی زمینی'],
    ]];

    this.events[2][1] = [[
      ['روز بزرگداشت سعدی'],
    ]];

    this.events[2][2] = [[
      ['تأسیس سپاه پاسداران انقلاب اسلامی (۱۳۵۸ ه‍.ش)'],
      ['سالروز اعلام انقلاب فرهنگی (۱۳۵۹ ه‍.ش)'],
      ['روز زمین پاک'],
    ]];

    this.events[2][3] = [[
      ['روز بزرگداشت شیخ بهایی'],
      ['روز معماری'],
      ['سالروز شهادت امیر سپهبد قرنی (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[2][5] = [[
      ['شکست حمله نظامی آمریکا به ایران در طبس (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[2][7] = [[
      ['روز ایمنی حمل و نقل'],
    ]];

    this.events[2][9] = [[
      ['روز شوراها'],
    ]];

    this.events[2][10] = [[
      ['روز ملی خلیج فارس'],
      ['آغاز عملیات بیت المقدس (۱۳۶۱ ه‍.ش)'],
    ]];

    this.events[2][12] = [[
      ['شهادت استاد مرتضی مطهری و روز معلم (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[2][15] = [[
      ['روز بزرگداشت شیخ صدوق'],
    ]];

    this.events[2][18] = [[
      ['روز بیماری‌های خاص و صعب‌العلاج'],
    ]];

    this.events[2][19] = [[
      ['روز بزرگداشت شیخ کلینی'],
      ['روز اسناد ملی و میراث مکتوب'],
    ]];

    this.events[2][24] = [[
      ['لغو امتیاز تنباکو به فتوای آیت‌اللّه میرزا حسن شیرازی (۱۲۷۰ ه‍.ش)'],
    ]];

    this.events[2][25] = [[
      ['روز پاسداشت زبان فارسی و بزرگداشت حکیم ابوالقاسم فردوسی'],
    ]];

    this.events[2][27] = [[
      ['روز ارتباطات و روابط عمومی'],
    ]];

    this.events[2][28] = [[
      ['روز بزرگداشت حکیم عمر خیام'],
    ]];

    this.events[2][30] = [[
      ['روز ملی جمعیت'],
    ]];

    this.events[2][31] = [[
      ['روز اهدای عضو، اهدای زندگی'],
    ]];

    this.events[3][1] = [[
      ['روز بهره‌وری و بهینه‌سازی مصرف'],
      ['روز بزرگداشت ملّاصدرا (صدرالمتألهین)'],
    ]];

    this.events[3][3] = [[
      ['فتح خرمشهر در عملیات بیت‌المقدس و روز مقاومت، ایثار و پیروزی (۱۳۶۱ ه‍.ش)'],
    ]];

    this.events[3][4] = [[
      ['روز دزفول'],
      ['روز مقاومت و پایداری'],
    ]];

    this.events[3][5] = [[
      ['روز نسیم مهر (روز حمایت از خانواده زندانیان)'],
    ]];

    this.events[3][7] = [[
      ['افتتاح اولین دوره‌ی مجلس شورای اسلامی (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[3][14] = [[
      ['رحلت حضرت امام خمینی (رحمة‌اللّه علیه) رهبر کبیر انقلاب و بنیان‌گذار جمهوری اسلامی ایران (۱۳۶۸ ه‍.ش)', true],
      ['انتخاب حضرت آیت‌اللّه امام خامنه‌ای به رهبری (۱۳۶۸ ه‍.ش)'],
    ], true];

    this.events[3][15] = [[
      ['قیام خونین ۱۵ خرداد (۱۳۴۲ ه‍.ش)', true],
      ['زندانی شدن حضرت امام خمینی (رحمة‌اللّه علیه) به دست مأموران ستم‌شاهی پهلوی (۱۳۴۲ ه‍.ش)'],
    ], true];

    this.events[3][20] = [[
      ['روز صنایع دستی'],
      ['شهادت آیت‌اللّه سعیدی به دست مأموران ستم‌شاهی پهلوی (۱۳۴۹ ه‍.ش)'],
    ]];

    this.events[3][26] = [[
      ['شهادت سربازان دلیر اسلام :بخارایی، امانی، صفار هرندی و نیک‌نژاد (۱۳۴۴ ه‍.ش)'],
    ]];

    this.events[3][27] = [[
      ['روز جهاد کشاورزی (تشکیل جهاد سازندگی به فرمان حضرت امام خمینی رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[3][29] = [[
      ['درگذشت دکتر علی شریعتی (۱۳۵۶ ه‍.ش)'],
    ]];

    this.events[3][30] = [[
      ['شهادت زائران حرم رضوی علیه‌السلام به دست ایادی آمریکا در روز عاشورا (۱۳۷۳ ه‍.ش)'],
    ]];

    this.events[3][31] = [[
      ['شهادت دکتر مصطفی چمران (۱۳۶۰ ه‍.ش)'],
      ['روز بسیج استادان'],
    ]];

    this.events[4][1] = [[
      ['روز تبلیغ و اطلاع‌رسانی دینی (سالروز صدور فرمان امام خمینی رحمة‌اللّه علیه مبنی بر تأسیس سازمان تبلیغات اسلامی) (۱۳۶۰ ه‍.ش)'],
      ['روز اصناف'],
    ]];

    this.events[4][7] = [[
      ['شهادت مظلومانه‌ی آیت‌اللّه دکتر بهشتی و ۷۲ تن از یاران امام با انفجار بمب به دست منافقان در دفتر مرکزی حزب جمهوری اسلامی (۱۳۶۰ ه‍.ش)'],
      ['روز قوه‌ی قضائیه'],
      ['سالروز بمباران شیمیایی شهر سردشت (۱۳۶۶ ه‍.ش)'],
    ]];

    this.events[4][8] = [[
      ['روز مبارزه با سلاح‌های شیمیایی و میکروبی'],
    ]];

    this.events[4][10] = [[
      ['روز صنعت و معدن'],
      ['روز آزادسازی شهر مهران'],
      ['روز بزرگداشت صائب تبریزی'],
    ]];

    this.events[4][11] = [[
      ['شهادت آیت‌اللّه صدوقی چهارمین شهید محراب به دست منافقان (۱۳۶۱ ه‍.ش)'],
    ]];

    this.events[4][12] = [[
      ['حمله‌ی ددمنشانه‌ی ناوگان آمریکای جنایتکار به هواپیمای مسافربری جمهوری اسلامی ایران (۱۳۶۷ ه‍.ش)'],
      ['روز افشای حقوق بشر آمریکایی'],
      ['روز بزرگداشت علامه امینی (۱۳۴۹ ه‍.ش)'],
    ]];

    this.events[4][14] = [[
      ['روز قلم'],
      ['روز شهرداری و دهیاری'],
    ]];

    this.events[4][16] = [[
      ['روز مالیات'],
    ]];

    this.events[4][18] = [[
      ['روز ادبیات کودکان و نوجوانان'],
      ['کشف توطئه‌ی آمریکایی در پایگاه هوایی شهید نوژه (کودتای نافرجام نقاب) (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[4][21] = [[
      ['روز عفاف و حجاب'],
      ['حمله به مسجد گوهرشاد و کشتار مردم به دست رضاخان (۱۳۱۴ ه‍.ش)'],
    ]];

    this.events[4][23] = [[
      ['سالروز اشتباه برجام، مایه‌ی عبرت آیندگان (۱۳۹۴ ه‍.ش)'],
      ['گشایش نخستین مجلس خبرگان رهبری (۱۳۶۲ ه‍.ش)'],
    ]];

    this.events[4][25] = [[
      ['روز بهزیستی و تأمین اجتماعی'],
    ]];

    this.events[4][26] = [[
      ['سالروز تأسیس نهاد شورای نگهبان (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[4][27] = [[
      ['اعلام پذیرش قطعنامه‌ی ۵۹۸ شورای امنیت از سوی ایران (۱۳۶۷ ه‍.ش)'],
    ]];

    this.events[4][30] = [[
      ['روز بزرگداشت آیت‌اللّه سید ابوالقاسم کاشانی'],
    ]];

    this.events[5][4] = [[
      ['روز بزرگداشت شیخ صفی‌الدین اردبیلی'],
    ]];

    this.events[5][5] = [[
      ['سالروز عملیات افتخار‌آفرین مرصاد (۱۳۶۷ ه‍.ش)'],
    ]];

    this.events[5][6] = [[
      ['روز کارآفرینی و آموزش‌های فنّی‌و‌حرفه‌ای'],
    ]];

    this.events[5][8] = [[
      ['روز بزرگداشت شیخ شهاب‌الدین سهروردی (شیخ اشراق)'],
    ]];

    this.events[5][9] = [[
      ['روز اهدای خون'],
    ]];

    this.events[5][11] = [[
      ['شهادت آیت‌اللّه شیخ فضل‌اللّه نوری (۱۲۸۸ ه‍.ش)'],
    ]];

    this.events[5][14] = [[
      ['صدور فرمان مشروطیت (۱۲۸۵ ه‍.ش)'],
      ['روز حقوق بشر اسلامی و کرامت انسانی'],
    ]];

    this.events[5][15] = [[
      ['انفجار بمب‌های اتمی آمریکای جنایتکار در هیروشیما و ناکازاکی (۶ و ۹ اوت ۱۹۴۵ میلادی) با صدهاهزار کشته'],
      ['سالروز شهادت امیر سرلشکر خلبان عباس بابایی (۱۳۶۶ ه‍.ش)'],
    ]];

    this.events[5][16] = [[
      ['تشکیل جهاد دانشگاهی (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[5][17] = [[
      ['روز خبرنگار'],
    ]];

    this.events[5][18] = [[
      ['روز بزرگداشت شهدای مدافع حرم'],
    ]];

    this.events[5][21] = [[
      ['روز حمایت از صنایع کوچک'],
    ]];

    this.events[5][22] = [[
      ['روز تشکّل‌ها و مشارکت‌های اجتماعی'],
    ]];

    this.events[5][23] = [[
      ['روز مقاومت اسلامی'],
    ]];

    this.events[5][26] = [[
      ['آغاز بازگشت آزادگان به میهن اسلامی (۱۳۶۹ ه‍.ش)'],
    ]];

    this.events[5][28] = [[
      ['کودتای آمریکا برای بازگرداندن شاه  (۱۳۳۲ ه‍.ش)'],
      ['گشایش مجلس خبرگان برای بررسی نهایی قانون اساسی جمهوری اسلامی ایران (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[5][30] = [[
      ['روز بزرگداشت علامه مجلسی'],
    ]];

    this.events[5][31] = [[
      ['روز صنعت دفاعی'],
    ]];

    this.events[6][1] = [[
      ['روز بزرگداشت ابوعلی سینا'],
      ['روز پزشک'],
    ]];

    this.events[6][2] = [[
      ['آغاز هفته‌ی دولت'],
      ['شهادت سید‌علی اندرزگو (در روز ۱۹ ماه مبارک رمضان) (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[6][3] = [[
      ['اِشغال ایران توسّط متّفقین و فرار رضاخان (۱۳۲۰ ه‍.ش)'],
    ]];

    this.events[6][4] = [[
      ['روز کارمند'],
    ]];

    this.events[6][5] = [[
      ['روز بزرگداشت محمّدبن زکریای رازی'],
      ['روز داروسازی'],
      ['روز کشتی'],
    ]];

    this.events[6][8] = [[
      ['روز مبارزه با تروریسم (انفجار دفتر نخست‌وزیری به دست منافقان و شهادت مظلومانه‌ی شهیدان رجایی و باهنر) (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[6][10] = [[
      ['روز بانکداری اسلامی (سالروز تصویب قانون عملیات بانکی بدون ربا) (۱۳۶۲ ه‍.ش)'],
      ['روز تشکیل قرارگاه پدافند هوایی حضرت خاتم‌الانبیا صلی اللّه علیه و آله (۱۳۷۱ ه‍.ش)'],
    ]];

    this.events[6][11] = [[
      ['روز صنعت چاپ'],
    ]];

    this.events[6][12] = [[
      ['روز مبارزه بااستعمار انگلیس (سالروز شهادت رئیسعلی دلواری - ۱۲۹۴ هـ.ش)'],
      ['روز بهوَرز'],
    ]];

    this.events[6][13] = [[
      ['روز تعاون'],
      ['روز بزرگداشت ابوریحان بیرونی'],
      ['روز مردم‌شناسی'],
    ]];

    this.events[6][14] = [[
      ['شهادت آیت‌اللّه قدّوسی و سرتیپ وحید دستجردی (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[6][17] = [[
      ['قیام ۱۷ شهریور و کشتار جمعی از مردم به‌دست مأموران ستم‌شاهی پهلوی (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[6][19] = [[
      ['وفات آیت‌اللّه سیدمحمود طالقانی اوّلین امام جمعه‌ی تهران (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[6][20] = [[
      ['شهادت دومین شهید محراب آیت‌اللّه مدنی به دست منافقان (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[6][21] = [[
      ['روز سینما'],
    ]];

    this.events[6][27] = [[
      ['روز شعر و ادب فارسی'],
      ['روز بزرگداشت استاد سید‌محمّد‌حسین شهریار'],
    ]];

    this.events[6][31] = [[
      ['آغاز جنگ تحمیلی (۱۳۵۹ ه‍.ش)'],
      ['آغاز هفته‌ی دفاع مقدّس'],
    ]];

    this.events[7][5] = [[
      ['شکست حصر آبادان در عملیات ثامن‌الائمه علیه‌السلام (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[7][7] = [[
      ['روز بزرگداشت فرماندهان شهید دفاع مقدّس'],
      ['شهادت سرداران اسلام: فلاحی، فکوری، نامجو، کلاهدوز و جهان‌آرا (۱۳۶۰ ه‍.ش)'],
      ['روز آتش‌نشانی و ایمنی'],
      ['روز بزرگداشت شمس'],
    ]];

    this.events[7][8] = [[
      ['روز بزرگداشت مولوی'],
    ]];

    this.events[7][9] = [[
      ['روز همبستگی و همدردی با کودکان و نوجوانان فلسطینی'],
    ]];

    this.events[7][13] = [[
      ['هجرت حضرت امام خمینی (رحمة‌اللّه علیه) از عراق به پاریس (۱۳۵۷ ه‍.ش)'],
      ['روز نیروی انتظامی'],
    ]];

    this.events[7][14] = [[
      ['روز دامپزشکی'],
    ]];

    this.events[7][15] = [[
      ['روز روستا و عشایر'],
    ]];

    this.events[7][20] = [[
      ['روز بزرگداشت حافظ'],
    ]];

    this.events[7][23] = [[
      ['شهادت پنجمین شهید محراب آیت‌اللّه اشرفی اصفهانی به دست منافقان (۱۳۶۱ ه‍.ش)'],
    ]];

    this.events[7][24] = [[
      ['روز ملی پارالمپیک'],
      ['روز پیوند اولیا و مربیان'],
      ['سالروز واقعه‌ی به‌آتش‌کشیدن مسجد جامع شهر کرمان به دست دژخیمان حکومت پهلوی (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[7][26] = [[
      ['روز تربیت‌بدنی و ورزش'],
    ]];

    this.events[7][29] = [[
      ['روز صادرات'],
    ]];

    this.events[8][1] = [[
      ['شهادت مظلومانه‌ی آیت‌اللّه حاج سید مصطفی خمینی (۱۳۵۶ ه‍.ش)'],
      ['روز آمار و برنامه‌ریزی'],
    ]];

    this.events[8][4] = [[
      ['اعتراض و افشاگری حضرت امام خمینی (ره) علیه پذیرش کاپیتولاسیون (۱۳۴۳ ه‍.ش)'],
    ]];

    this.events[8][8] = [[
      ['شهادت محمّدحسین فهمیده (بسیجی ۱۳ ساله) (۱۳۵۹ ه‍.ش)'],
      ['روز نوجوان و بسیج دانش‌آموزی'],
      ['روز پدافند غیرعامل'],
    ]];

    this.events[8][10] = [[
      ['شهادت آیت‌اللّه قاضی طباطبایی، اوّلین شهید محراب به دست منافقان (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[8][13] = [[
      ['تسخیر لانه‌ی جاسوسی آمریکا به دست دانشجویان پیرو خط امام (۱۳۵۸ ه‍.ش)'],
      ['روز ملی مبارزه با استکبار جهانی'],
      ['روز دانش‌آموز'],
      ['تبعید حضرت امام خمینی (رحمة‌اللّه علیه) از ایران به ترکیه (۱۳۴۳ ه‍.ش)'],
    ]];

    this.events[8][14] = [[
      ['روز فرهنگ عمومی'],
    ]];

    this.events[8][18] = [[
      ['روز کیفیت'],
    ]];

    this.events[8][24] = [[
      ['روز کتاب، کتاب‌خوانی و کتابدار'],
      ['روز بزرگداشت آیت‌اللّه علامه سیدمحمّدحسین طباطبایی (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[8][26] = [[
      ['سالروز آزادسازی سوسنگرد (۱۳۵۹ ه‍.ش)'],
    ]];

    this.events[9][5] = [[
      ['روزبسیج مستضعفان (تشکیل بسیج مستضعفان به فرمان حضرت امام خمینی رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)'],
      ['سالروز قیام مردم گرگان (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[9][7] = [[
      ['روز نیروی دریایی'],
    ]];

    this.events[9][9] = [[
      ['روز بزرگداشت شیخ مفید'],
    ]];

    this.events[9][10] = [[
      ['شهادت آیت‌اللّه سید‌حسن مدرّس و روز مجلس (۱۳۱۶ ه‍.ش)'],
    ]];

    this.events[9][11] = [[
      ['شهادت میرزا‌کوچک‌خان جنگلی (۱۳۰۰ ه‍.ش)'],
    ]];

    this.events[9][12] = [[
      ['روز قانون اساسی جمهوری اسلامی ایران (تصویب قانون اساسی جمهوری اسلامی ایران) (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[9][13] = [[
      ['روز بیمه'],
    ]];

    this.events[9][16] = [[
      ['روز دانشجو'],
    ]];

    this.events[9][18] = [[
      ['معرّفی عراق به عنوان مسئول و آغازگر جنگ از سوی سازمان ملل (۱۳۷۰ ه‍.ش)'],
    ]];

    this.events[9][19] = [[
      ['تشکیل شورای عالی انقلاب فرهنگی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۶۳ ه‍.ش)'],
    ]];

    this.events[9][20] = [[
      ['شهادت آیت‌اللّه دستغیب، سومین شهید محراب به دست منافقان (۱۳۶۰ ه‍.ش)'],
    ]];

    this.events[9][25] = [[
      ['روز پژوهش'],
    ]];

    this.events[9][26] = [[
      ['روز حمل‌و‌نقل و رانندگان'],
    ]];

    this.events[9][27] = [[
      ['شهادت آیت‌اللّه دکتر محمّد مفتّح (۱۳۵۸ ه‍.ش)'],
      ['روز وحدت حوزه و دانشگاه'],
    ]];

    this.events[9][29] = [[
      ['روز تجلیل از شهید تندگویان'],
    ]];

    this.events[9][30] = [[
      ['شب یلدا'],
    ]];

    this.events[10][3] = [[
      ['روز ثبت‌احوال'],
    ]];

    this.events[10][5] = [[
      ['روز ایمنی در برابر زلزله و کاهش اثرات بلایای طبیعی'],
    ]];

    this.events[10][7] = [[
      ['سالروز تشکیل نهضت سوادآموزی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)'],
      ['شهادت آیت‌اللّه حسین غفّاری به دست مأموران ستم‌شاهی پهلوی (۱۳۵۳ ه‍.ش)'],
    ]];

    this.events[10][8] = [[
      ['روز صنعت پتروشیمی'],
    ]];

    this.events[10][9] = [[
      ['روز بصیرت و میثاق امّت با ولایت (سالروز حماسه‌ی ۹ دی ۸۸)'],
    ]];

    this.events[10][13] = [[
      ['روز جهانی مقاومت - شهادت الگوی اخلاص و عمل، سردار سپهبد حاج قاسم سلیمانی و هم‌رزمان ایشان به دست استکبار جهانی (۱۳۹۸ ه‍.ش)'],
      ['ابلاغ پیام تاریخی حضرت امام خمینی (ره) به گورباچف رهبر شوروی سابق (۱۳۶۷ ه‍.ش)'],
    ]];

    this.events[10][17] = [[
      ['اجرای طرح استعماری حذف حجاب (کشف حجاب) به دست رضاخان دیکتاتور (۱۳۱۴ ه‍.ش)'],
      ['روز بزرگداشت خواجوی کرمانی'],
    ]];

    this.events[10][19] = [[
      ['قیام خونین مردم قم (۱۳۵۶ ه‍.ش)'],
    ]];

    this.events[10][20] = [[
      ['شهادت میرزا تقی خان امیرکبیر (۱۲۳۰ ه‍.ش)'],
    ]];

    this.events[10][22] = [[
      ['تشکیل شورای انقلاب به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[10][26] = [[
      ['فرار شاه معدوم (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[10][27] = [[
      ['شهادت شهیدان: نواب صفوی، طهماسبی، برادران واحدی و ذوالقدر از فدائیان اسلام (۱۳۳۴ ه‍.ش)'],
    ]];

    this.events[10][29] = [[
      ['روز غزه'],
    ]];

    this.events[11][6] = [[
      ['سالروز حماسه‌ی مردم آمل'],
    ]];

    this.events[11][12] = [[
      ['سالروز بازگشت حضرت امام خمینی (رحمة‌اللّه علیه) به ایران و آغاز دهه‌ی مبارک فجر انقلاب اسلامی'],
    ]];

    this.events[11][14] = [[
      ['روز فنّاوری فضایی'],
    ]];

    this.events[11][19] = [[
      ['روز نیروی هوایی'],
    ]];

    this.events[11][21] = [[
      ['شکسته‌شدن حکومت‌نظامی به فرمان امام خمینی (رحمة‌اللّه علیه) (۱۳۵۷ ه‍.ش)'],
    ]];

    this.events[11][22] = [[
      ['پیروزی انقلاب اسلامی ایران و سقوط نظام شاهنشاهی (۱۳۵۷ ه‍.ش)', true],
    ], true];

    this.events[11][25] = [[
      ['صدور حکم تاریخی حضرت امام خمینی (رحمة‌اللّه علیه) مبنی بر ارتداد سلمان‌رشدی نویسنده‌ی خائن کتاب آیات شیطانی (۱۳۶۷ ه‍.ش)'],
    ]];

    this.events[11][29] = [[
      ['قیام مردم تبریز به مناسبت چهلمین روز شهادت شهدای قم (۱۳۵۶ ه‍.ش)'],
      ['روز اقتصاد مقاومتی و کارآفرینی'],
    ]];

    this.events[12][3] = [[
      ['کودتای انگلیسی رضاخان (۱۲۹۹ ه‍.ش)'],
    ]];

    this.events[12][5] = [[
      ['روز بزرگداشت خواجه‌نصیرالدّین طوسی'],
      ['روز مهندسی'],
    ]];

    this.events[12][8] = [[
      ['روز امور تربیتی و تربیت اسلامی'],
      ['روز بزرگداشت حکیم حاج ملاهادی سبزواری'],
    ]];

    this.events[12][9] = [[
      ['روز حمایت از حقوق مصرف‌کنندگان'],
    ]];

    this.events[12][14] = [[
      ['روز احسان و نیکوکاری'],
      ['روز ترویج فرهنگ قرض‌الحسنه'],
    ]];

    this.events[12][15] = [[
      ['روز درختکاری'],
    ]];

    this.events[12][18] = [[
      ['روز بزرگداشت سید‌جمال‌الدّین اسدآبادی'],
      ['سالروز تأسیس کانون‌های فرهنگی‌و‌هنری مساجد کشور'],
    ]];

    this.events[12][20] = [[
      ['روز راهیان نور'],
    ]];

    this.events[12][21] = [[
      ['روز بزرگداشت نظامی گنجوی'],
    ]];

    this.events[12][22] = [[
      ['روز بزرگداشت شهدا (سالروز صدور فرمان حضرت امام خمینی رحمة‌اللّه علیه، مبنی بر تأسیس بنیاد شهید انقلاب اسلامی) (۱۳۵۸ ه‍.ش)'],
    ]];

    this.events[12][25] = [[
      ['بمباران شیمیایی حلبچه به دست ارتش بعث عراق (۱۳۶۶ ه‍.ش)'],
    ]];

    this.events[12][29] = [[
      ['روز ملّی‌شدن صنعت نفت ایران (۱۳۲۹ ه‍.ش)', true],
    ], true];

    this.events[12][30] = [[
      ['این روز فقط در سال‌های کبیسه وجود دارد و معمولاً تعطیل اعلام می‌گردد'],
    ]];

  }
};
