function evList() {
  this._init();
}

evList.prototype = {
  name: 'مناسبت‌های جهانی',
  type: 'gregorian',
  /* [month][day] = [title, isHoliday] */
  events: [[], [], [], [], [], [], [], [], [], [], [], [], []],

  _init: function () {

    this.events[1][1] = [[
      ['آغاز سال میلادی'],
    ]];

    this.events[1][26] = [[
      ['روز جهانی گمرک'],
    ]];

    this.events[3][22] = [[
      ['روز جهانی آب'],
    ]];

    this.events[3][23] = [[
      ['روز جهانی هواشناسی'],
    ]];

    this.events[5][1] = [[
      ['روز جهانی کار و کارگر'],
    ]];

    this.events[5][5] = [[
      ['روز جهانی ماما'],
    ]];

    this.events[5][8] = [[
      ['روز جهانی صلیب‌سرخ و هلال‌احمر'],
    ]];

    this.events[5][18] = [[
      ['روز جهانی موزه و میراث‌فرهنگی'],
    ]];

    this.events[5][31] = [[
      ['روز جهانی بدون دخانیات'],
    ]];

    this.events[6][5] = [[
      ['روز جهانی محیط زیست'],
    ]];

    this.events[6][17] = [[
      ['روز جهانی بیابان‌زدایی'],
    ]];

    this.events[6][26] = [[
      ['روز جهانی مبارزه با مواد‌مخدر'],
    ]];

    this.events[8][1] = [[
      ['روز جهانی شیر مادر'],
    ]];

    this.events[8][21] = [[
      ['روز جهانی مسجد'],
    ]];

    this.events[9][27] = [[
      ['روز جهانی جهانگردی - روز گردشگری'],
    ]];

    this.events[9][30] = [[
      ['روز جهانی دریانوردی'],
      ['روز جهانی ناشنوایان'],
    ]];

    this.events[10][1] = [[
      ['روز جهانی سالمندان'],
    ]];

    this.events[10][8] = [[
      ['روز جهانی کودک'],
    ]];

    this.events[10][9] = [[
      ['روز جهانی پست'],
    ]];

    this.events[10][14] = [[
      ['روز جهانی استاندارد'],
    ]];

    this.events[10][15] = [[
      ['روز جهانی نابینایان (عصای سفید)'],
    ]];

    this.events[10][16] = [[
      ['روز جهانی غذا'],
    ]];

    this.events[11][10] = [[
      ['روز جهانی علم در خدمت صلح و توسعه'],
    ]];

    this.events[11][21] = [[
      ['روز حکمت و فلسفه - روز بزرگداشت ابونصر فارابی'],
    ]];

    this.events[12][1] = [[
      ['روز جهانی مبارزه با ایدز'],
    ]];

    this.events[12][3] = [[
      ['روز جهانی معلولان'],
    ]];

    this.events[12][7] = [[
      ['روز جهانی هواپیمایی'],
    ]];

    this.events[12][25] = [[
      ['ولادت حضرت عیسی مسیح علیه‌السلام'],
    ]];

  }
};
